; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-3-7-5)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	p1-2 - location
	p1-3 - location
	p2-0 - location
	p2-5 - location
	p3-0 - location
	p3-4 - location
	p3-6 - location
	p5-1 - location
	p5-8 - location
	p6-2 - location
	p6-7 - location
	p7-2 - location
	p7-3 - location
	p7-6 - location
	p8-0 - location
	p8-2 - location
	)
	(:init
	(at driver1 s5)
	(at driver2 s0)
	(at driver3 s4)
	(at truck1 s6)
	(empty truck1)
	(at truck2 s6)
	(empty truck2)
	(at truck3 s8)
	(empty truck3)
	(at truck4 s0)
	(empty truck4)
	(at truck5 s5)
	(empty truck5)
	(at truck6 s0)
	(empty truck6)
	(at truck7 s4)
	(empty truck7)
	(at package1 s8)
	(at package2 s5)
	(at package3 s5)
	(at package4 s7)
	(at package5 s8)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 41)
	(= (time-to-walk p1-2 s1) 41)
	(= (time-to-walk s2 p1-2) 50)
	(= (time-to-walk p1-2 s2) 50)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(= (time-to-walk s1 p1-3) 39)
	(= (time-to-walk p1-3 s1) 39)
	(= (time-to-walk s3 p1-3) 24)
	(= (time-to-walk p1-3 s3) 24)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(= (time-to-walk s2 p2-0) 52)
	(= (time-to-walk p2-0 s2) 52)
	(= (time-to-walk s0 p2-0) 28)
	(= (time-to-walk p2-0 s0) 28)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(= (time-to-walk s2 p2-5) 86)
	(= (time-to-walk p2-5 s2) 86)
	(= (time-to-walk s5 p2-5) 9)
	(= (time-to-walk p2-5 s5) 9)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(= (time-to-walk s3 p3-0) 40)
	(= (time-to-walk p3-0 s3) 40)
	(= (time-to-walk s0 p3-0) 78)
	(= (time-to-walk p3-0 s0) 78)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(= (time-to-walk s3 p3-4) 10)
	(= (time-to-walk p3-4 s3) 10)
	(= (time-to-walk s4 p3-4) 74)
	(= (time-to-walk p3-4 s4) 74)
	(path s3 p3-6)
	(path p3-6 s3)
	(path s6 p3-6)
	(path p3-6 s6)
	(= (time-to-walk s3 p3-6) 40)
	(= (time-to-walk p3-6 s3) 40)
	(= (time-to-walk s6 p3-6) 60)
	(= (time-to-walk p3-6 s6) 60)
	(path s5 p5-1)
	(path p5-1 s5)
	(path s1 p5-1)
	(path p5-1 s1)
	(= (time-to-walk s5 p5-1) 58)
	(= (time-to-walk p5-1 s5) 58)
	(= (time-to-walk s1 p5-1) 69)
	(= (time-to-walk p5-1 s1) 69)
	(path s5 p5-8)
	(path p5-8 s5)
	(path s8 p5-8)
	(path p5-8 s8)
	(= (time-to-walk s5 p5-8) 55)
	(= (time-to-walk p5-8 s5) 55)
	(= (time-to-walk s8 p5-8) 8)
	(= (time-to-walk p5-8 s8) 8)
	(path s6 p6-2)
	(path p6-2 s6)
	(path s2 p6-2)
	(path p6-2 s2)
	(= (time-to-walk s6 p6-2) 42)
	(= (time-to-walk p6-2 s6) 42)
	(= (time-to-walk s2 p6-2) 13)
	(= (time-to-walk p6-2 s2) 13)
	(path s6 p6-7)
	(path p6-7 s6)
	(path s7 p6-7)
	(path p6-7 s7)
	(= (time-to-walk s6 p6-7) 63)
	(= (time-to-walk p6-7 s6) 63)
	(= (time-to-walk s7 p6-7) 56)
	(= (time-to-walk p6-7 s7) 56)
	(path s7 p7-2)
	(path p7-2 s7)
	(path s2 p7-2)
	(path p7-2 s2)
	(= (time-to-walk s7 p7-2) 69)
	(= (time-to-walk p7-2 s7) 69)
	(= (time-to-walk s2 p7-2) 72)
	(= (time-to-walk p7-2 s2) 72)
	(path s7 p7-3)
	(path p7-3 s7)
	(path s3 p7-3)
	(path p7-3 s3)
	(= (time-to-walk s7 p7-3) 2)
	(= (time-to-walk p7-3 s7) 2)
	(= (time-to-walk s3 p7-3) 56)
	(= (time-to-walk p7-3 s3) 56)
	(path s8 p8-0)
	(path p8-0 s8)
	(path s0 p8-0)
	(path p8-0 s0)
	(= (time-to-walk s8 p8-0) 54)
	(= (time-to-walk p8-0 s8) 54)
	(= (time-to-walk s0 p8-0) 58)
	(= (time-to-walk p8-0 s0) 58)
	(path s8 p8-2)
	(path p8-2 s8)
	(path s2 p8-2)
	(path p8-2 s2)
	(= (time-to-walk s8 p8-2) 46)
	(= (time-to-walk p8-2 s8) 46)
	(= (time-to-walk s2 p8-2) 6)
	(= (time-to-walk p8-2 s2) 6)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 30)
	(= (time-to-drive s2 s0) 30)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 86)
	(= (time-to-drive s3 s0) 86)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 55)
	(= (time-to-drive s4 s0) 55)
	(link s0 s7)
	(link s7 s0)
	(= (time-to-drive s0 s7) 68)
	(= (time-to-drive s7 s0) 68)
	(link s0 s8)
	(link s8 s0)
	(= (time-to-drive s0 s8) 10)
	(= (time-to-drive s8 s0) 10)
	(link s1 s7)
	(link s7 s1)
	(= (time-to-drive s1 s7) 7)
	(= (time-to-drive s7 s1) 7)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 96)
	(= (time-to-drive s1 s2) 96)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 96)
	(= (time-to-drive s4 s2) 96)
	(link s2 s6)
	(link s6 s2)
	(= (time-to-drive s2 s6) 15)
	(= (time-to-drive s6 s2) 15)
	(link s2 s8)
	(link s8 s2)
	(= (time-to-drive s2 s8) 35)
	(= (time-to-drive s8 s2) 35)
	(link s3 s8)
	(link s8 s3)
	(= (time-to-drive s3 s8) 73)
	(= (time-to-drive s8 s3) 73)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 25)
	(= (time-to-drive s1 s4) 25)
	(link s4 s7)
	(link s7 s4)
	(= (time-to-drive s4 s7) 9)
	(= (time-to-drive s7 s4) 9)
	(link s4 s8)
	(link s8 s4)
	(= (time-to-drive s4 s8) 13)
	(= (time-to-drive s8 s4) 13)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 84)
	(= (time-to-drive s1 s5) 84)
	(link s6 s1)
	(link s1 s6)
	(= (time-to-drive s6 s1) 67)
	(= (time-to-drive s1 s6) 67)
	(link s7 s3)
	(link s3 s7)
	(= (time-to-drive s7 s3) 82)
	(= (time-to-drive s3 s7) 82)
	(link s7 s5)
	(link s5 s7)
	(= (time-to-drive s7 s5) 39)
	(= (time-to-drive s5 s7) 39)
	(link s7 s6)
	(link s6 s7)
	(= (time-to-drive s7 s6) 74)
	(= (time-to-drive s6 s7) 74)
	(link s8 s1)
	(link s1 s8)
	(= (time-to-drive s8 s1) 24)
	(= (time-to-drive s1 s8) 24)
	(link s8 s6)
	(link s6 s8)
	(= (time-to-drive s8 s6) 51)
	(= (time-to-drive s6 s8) 51)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s3)
	(at driver2 s3)
	(at driver3 s2)
	(at truck2 s1)
	(at truck3 s5)
	(at truck4 s8)
	(at truck5 s1)
	(at truck6 s3)
	(at package1 s4)
	(at package2 s4)
	(at package3 s0)
	(at package4 s7)
	(at package5 s4)
	))

(:metric minimize (+ (+ (* 2  (total-time)) (* 4  (driven))) (* 1  (walked))))

)

; plan
1. (walk driver2 s0 p8-0)
   deleted: (at driver2 s0)
   added: (at driver2 p8-0)
   changed: (walked) from 0 to 58
   goals met: 1 of 13
2. (board-truck driver1 truck5 s5)
   deleted: (at driver1 s5) (empty truck5)
   added: (driving driver1 truck5)
   goals met: 1 of 13
3. (load-truck package2 truck5 s5)
   deleted: (at package2 s5)
   added: (in package2 truck5)
   goals met: 1 of 13
4. (load-truck package5 truck3 s8)
   deleted: (at package5 s8)
   added: (in package5 truck3)
   goals met: 1 of 13
5. (load-truck package3 truck5 s5)
   deleted: (at package3 s5)
   added: (in package3 truck5)
   goals met: 1 of 13
6. (walk driver2 p8-0 s8)
   deleted: (at driver2 p8-0)
   added: (at driver2 s8)
   changed: (walked) from 58 to 112
   goals met: 1 of 13
7. (board-truck driver2 truck3 s8)
   deleted: (at driver2 s8) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 1 of 13
8. (board-truck driver3 truck7 s4)
   deleted: (at driver3 s4) (empty truck7)
   added: (driving driver3 truck7)
   goals met: 1 of 13
9. (drive-truck truck5 s5 s7 driver1)
   deleted: (at truck5 s5)
   added: (at truck5 s7)
   changed: (driven) from 0 to 39
   goals met: 1 of 13
10. (drive-truck truck7 s4 s2 driver3)
   deleted: (at truck7 s4)
   added: (at truck7 s2)
   changed: (driven) from 39 to 135
   goals met: 1 of 13
11. (load-truck package1 truck3 s8)
   deleted: (at package1 s8)
   added: (in package1 truck3)
   goals met: 1 of 13
12. (disembark-truck driver3 truck7 s2)
   deleted: (driving driver3 truck7)
   added: (at driver3 s2) (empty truck7)
   goals met: 2 of 13
13. (drive-truck truck5 s7 s0 driver1)
   deleted: (at truck5 s7)
   added: (at truck5 s0)
   changed: (driven) from 135 to 203
   goals met: 2 of 13
14. (unload-truck package3 truck5 s0)
   deleted: (in package3 truck5)
   added: (at package3 s0)
   goals met: 3 of 13
15. (drive-truck truck3 s8 s6 driver2)
   deleted: (at truck3 s8)
   added: (at truck3 s6)
   changed: (driven) from 203 to 254
   goals met: 3 of 13
16. (drive-truck truck3 s6 s7 driver2)
   deleted: (at truck3 s6)
   added: (at truck3 s7)
   changed: (driven) from 254 to 328
   goals met: 3 of 13
17. (drive-truck truck5 s0 s4 driver1)
   deleted: (at truck5 s0)
   added: (at truck5 s4)
   changed: (driven) from 328 to 383
   goals met: 3 of 13
18. (unload-truck package2 truck5 s4)
   deleted: (in package2 truck5)
   added: (at package2 s4)
   goals met: 4 of 13
19. (drive-truck truck5 s4 s1 driver1)
   deleted: (at truck5 s4)
   added: (at truck5 s1)
   changed: (driven) from 383 to 408
   goals met: 5 of 13
20. (drive-truck truck3 s7 s0 driver2)
   deleted: (at truck3 s7)
   added: (at truck3 s0)
   changed: (driven) from 408 to 476
   goals met: 5 of 13
21. (disembark-truck driver1 truck5 s1)
   deleted: (driving driver1 truck5)
   added: (at driver1 s1) (empty truck5)
   goals met: 5 of 13
22. (walk driver1 s1 p1-3)
   deleted: (at driver1 s1)
   added: (at driver1 p1-3)
   changed: (walked) from 112 to 151
   goals met: 5 of 13
23. (walk driver1 p1-3 s3)
   deleted: (at driver1 p1-3)
   added: (at driver1 s3)
   changed: (walked) from 151 to 175
   goals met: 6 of 13
24. (walk driver3 s2 p6-2)
   deleted: (at driver3 s2)
   added: (at driver3 p6-2)
   changed: (walked) from 175 to 188
   goals met: 5 of 13
25. (walk driver3 p6-2 s6)
   deleted: (at driver3 p6-2)
   added: (at driver3 s6)
   changed: (walked) from 188 to 230
   goals met: 5 of 13
26. (board-truck driver3 truck2 s6)
   deleted: (at driver3 s6) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 5 of 13
27. (drive-truck truck2 s6 s2 driver3)
   deleted: (at truck2 s6)
   added: (at truck2 s2)
   changed: (driven) from 476 to 491
   goals met: 5 of 13
28. (disembark-truck driver3 truck2 s2)
   deleted: (driving driver3 truck2)
   added: (at driver3 s2) (empty truck2)
   goals met: 6 of 13
29. (drive-truck truck3 s0 s7 driver2)
   deleted: (at truck3 s0)
   added: (at truck3 s7)
   changed: (driven) from 491 to 559
   goals met: 6 of 13
30. (walk driver3 s2 p2-0)
   deleted: (at driver3 s2)
   added: (at driver3 p2-0)
   changed: (walked) from 230 to 282
   goals met: 5 of 13
31. (walk driver3 p2-0 s0)
   deleted: (at driver3 p2-0)
   added: (at driver3 s0)
   changed: (walked) from 282 to 310
   goals met: 5 of 13
32. (board-truck driver3 truck4 s0)
   deleted: (at driver3 s0) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 5 of 13
33. (drive-truck truck4 s0 s8 driver3)
   deleted: (at truck4 s0)
   added: (at truck4 s8)
   changed: (driven) from 559 to 569
   goals met: 6 of 13
34. (walk driver1 s3 p3-0)
   deleted: (at driver1 s3)
   added: (at driver1 p3-0)
   changed: (walked) from 310 to 350
   goals met: 5 of 13
35. (walk driver1 p3-0 s0)
   deleted: (at driver1 p3-0)
   added: (at driver1 s0)
   changed: (walked) from 350 to 428
   goals met: 5 of 13
36. (board-truck driver1 truck6 s0)
   deleted: (at driver1 s0) (empty truck6)
   added: (driving driver1 truck6)
   goals met: 5 of 13
37. (drive-truck truck6 s0 s3 driver1)
   deleted: (at truck6 s0)
   added: (at truck6 s3)
   changed: (driven) from 569 to 655
   goals met: 6 of 13
38. (disembark-truck driver1 truck6 s3)
   deleted: (driving driver1 truck6)
   added: (at driver1 s3) (empty truck6)
   goals met: 7 of 13
39. (drive-truck truck4 s8 s2 driver3)
   deleted: (at truck4 s8)
   added: (at truck4 s2)
   changed: (driven) from 655 to 690
   goals met: 6 of 13
40. (disembark-truck driver3 truck4 s2)
   deleted: (driving driver3 truck4)
   added: (at driver3 s2) (empty truck4)
   goals met: 7 of 13
41. (board-truck driver3 truck2 s2)
   deleted: (at driver3 s2) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 6 of 13
42. (drive-truck truck3 s7 s4 driver2)
   deleted: (at truck3 s7)
   added: (at truck3 s4)
   changed: (driven) from 690 to 699
   goals met: 6 of 13
43. (unload-truck package1 truck3 s4)
   deleted: (in package1 truck3)
   added: (at package1 s4)
   goals met: 7 of 13
44. (unload-truck package5 truck3 s4)
   deleted: (in package5 truck3)
   added: (at package5 s4)
   goals met: 8 of 13
45. (disembark-truck driver2 truck3 s4)
   deleted: (driving driver2 truck3)
   added: (at driver2 s4) (empty truck3)
   goals met: 8 of 13
46. (disembark-truck driver3 truck2 s2)
   deleted: (driving driver3 truck2)
   added: (at driver3 s2) (empty truck2)
   goals met: 9 of 13
47. (board-truck driver3 truck4 s2)
   deleted: (at driver3 s2) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 8 of 13
48. (drive-truck truck4 s2 s8 driver3)
   deleted: (at truck4 s2)
   added: (at truck4 s8)
   changed: (driven) from 699 to 734
   goals met: 9 of 13
49. (board-truck driver2 truck3 s4)
   deleted: (at driver2 s4) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 9 of 13
50. (drive-truck truck3 s4 s2 driver2)
   deleted: (at truck3 s4)
   added: (at truck3 s2)
   changed: (driven) from 734 to 830
   goals met: 9 of 13
51. (drive-truck truck4 s8 s2 driver3)
   deleted: (at truck4 s8)
   added: (at truck4 s2)
   changed: (driven) from 830 to 865
   goals met: 8 of 13
52. (disembark-truck driver3 truck4 s2)
   deleted: (driving driver3 truck4)
   added: (at driver3 s2) (empty truck4)
   goals met: 9 of 13
53. (drive-truck truck3 s2 s1 driver2)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   changed: (driven) from 865 to 961
   goals met: 9 of 13
54. (disembark-truck driver2 truck3 s1)
   deleted: (driving driver2 truck3)
   added: (at driver2 s1) (empty truck3)
   goals met: 9 of 13
55. (walk driver2 s1 p1-3)
   deleted: (at driver2 s1)
   added: (at driver2 p1-3)
   changed: (walked) from 428 to 467
   goals met: 9 of 13
56. (walk driver2 p1-3 s3)
   deleted: (at driver2 p1-3)
   added: (at driver2 s3)
   changed: (walked) from 467 to 491
   goals met: 10 of 13
57. (board-truck driver3 truck4 s2)
   deleted: (at driver3 s2) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 9 of 13
58. (drive-truck truck4 s2 s1 driver3)
   deleted: (at truck4 s2)
   added: (at truck4 s1)
   changed: (driven) from 961 to 1057
   goals met: 9 of 13
59. (disembark-truck driver3 truck4 s1)
   deleted: (driving driver3 truck4)
   added: (at driver3 s1) (empty truck4)
   goals met: 9 of 13
60. (walk driver3 s1 p1-2)
   deleted: (at driver3 s1)
   added: (at driver3 p1-2)
   changed: (walked) from 491 to 532
   goals met: 9 of 13
61. (walk driver3 p1-2 s2)
   deleted: (at driver3 p1-2)
   added: (at driver3 s2)
   changed: (walked) from 532 to 582
   goals met: 10 of 13
62. (walk driver1 s3 p1-3)
   deleted: (at driver1 s3)
   added: (at driver1 p1-3)
   changed: (walked) from 582 to 606
   goals met: 9 of 13
63. (board-truck driver3 truck2 s2)
   deleted: (at driver3 s2) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 8 of 13
64. (drive-truck truck2 s2 s1 driver3)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   changed: (driven) from 1057 to 1153
   goals met: 9 of 13
65. (walk driver1 p1-3 s1)
   deleted: (at driver1 p1-3)
   added: (at driver1 s1)
   changed: (walked) from 606 to 645
   goals met: 9 of 13
66. (board-truck driver1 truck3 s1)
   deleted: (at driver1 s1) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 9 of 13
67. (drive-truck truck3 s1 s5 driver1)
   deleted: (at truck3 s1)
   added: (at truck3 s5)
   changed: (driven) from 1153 to 1237
   goals met: 10 of 13
68. (disembark-truck driver3 truck2 s1)
   deleted: (driving driver3 truck2)
   added: (at driver3 s1) (empty truck2)
   goals met: 10 of 13
69. (board-truck driver3 truck4 s1)
   deleted: (at driver3 s1) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 10 of 13
70. (disembark-truck driver1 truck3 s5)
   deleted: (driving driver1 truck3)
   added: (at driver1 s5) (empty truck3)
   goals met: 10 of 13
71. (drive-truck truck4 s1 s8 driver3)
   deleted: (at truck4 s1)
   added: (at truck4 s8)
   changed: (driven) from 1237 to 1261
   goals met: 11 of 13
72. (walk driver1 s5 p5-8)
   deleted: (at driver1 s5)
   added: (at driver1 p5-8)
   changed: (walked) from 645 to 700
   goals met: 11 of 13
73. (disembark-truck driver3 truck4 s8)
   deleted: (driving driver3 truck4)
   added: (at driver3 s8) (empty truck4)
   goals met: 11 of 13
74. (walk driver3 s8 p8-2)
   deleted: (at driver3 s8)
   added: (at driver3 p8-2)
   changed: (walked) from 700 to 746
   goals met: 11 of 13
75. (walk driver3 p8-2 s2)
   deleted: (at driver3 p8-2)
   added: (at driver3 s2)
   changed: (walked) from 746 to 752
   goals met: 12 of 13
76. (board-truck driver3 truck7 s2)
   deleted: (at driver3 s2) (empty truck7)
   added: (driving driver3 truck7)
   goals met: 11 of 13
77. (walk driver1 p5-8 s8)
   deleted: (at driver1 p5-8)
   added: (at driver1 s8)
   changed: (walked) from 752 to 760
   goals met: 11 of 13
78. (drive-truck truck7 s2 s8 driver3)
   deleted: (at truck7 s2)
   added: (at truck7 s8)
   changed: (driven) from 1261 to 1296
   goals met: 11 of 13
79. (disembark-truck driver3 truck7 s8)
   deleted: (driving driver3 truck7)
   added: (at driver3 s8) (empty truck7)
   goals met: 11 of 13
80. (walk driver3 s8 p8-2)
   deleted: (at driver3 s8)
   added: (at driver3 p8-2)
   changed: (walked) from 760 to 806
   goals met: 11 of 13
81. (walk driver3 p8-2 s2)
   deleted: (at driver3 p8-2)
   added: (at driver3 s2)
   changed: (walked) from 806 to 812
   goals met: 12 of 13
82. (board-truck driver1 truck7 s8)
   deleted: (at driver1 s8) (empty truck7)
   added: (driving driver1 truck7)
   goals met: 12 of 13
83. (drive-truck truck7 s8 s3 driver1)
   deleted: (at truck7 s8)
   added: (at truck7 s3)
   changed: (driven) from 1296 to 1369
   goals met: 12 of 13
84. (disembark-truck driver1 truck7 s3)
   deleted: (driving driver1 truck7)
   added: (at driver1 s3) (empty truck7)
   goals met: 13 of 13
